//----------------------------------------------------------------------------------
// file: SocketServer.h
// date: 02/17/2019
// desc: このクラスをベースに独自のサーバを構築.
//----------------------------------------------------------------------------------

#ifndef _INCLUDED_NETWORK_SOCKET_SERVER_
#define _INCLUDED_NETWORK_SOCKET_SERVER_

//----------------------------------------------------------------------------------
// includes
//----------------------------------------------------------------------------------
#include "NetworkCommon.h"
#include "Descriptor.h"

namespace Network
{
		class SocketServer :public Descriptor
		{
		public:
				//----------------------------------------------------------------------------------
				// other
				//----------------------------------------------------------------------------------
				SocketServer() = delete;
				SocketServer( const int nPortNumber, int ipVersion, int type, int protocol = 0 );
				~SocketServer() {}


		private:
				//----------------------------------------------------------------------------------
				// private  variables
				//----------------------------------------------------------------------------------
				SOCKET m_clients[MAX_SOCKET_COUNTS];
				int m_nSocketCounts;

		public:
				//----------------------------------------------------------------------------------
				// public  variables
				//----------------------------------------------------------------------------------
				/* NOTHING */

		private:
				//----------------------------------------------------------------------------------
				// private  methods
				//----------------------------------------------------------------------------------
				/* NOTHING */

		public:
				//----------------------------------------------------------------------------------
				// public  methods
				//----------------------------------------------------------------------------------
				int Accept();
				virtual int Send( int index, char* pData, size_t uDataSize );

		};// class SocketServer

}// namespace Network

#endif // ! _INCLUDED_NETWORK_SOCKET_SERVER_